erp3l/src/Enums/СпособыВычисленияПараметровОперандов/СпособыВычисленияПараметровОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВычисленияПараметровОперандов</name>
  <enumValues>
    <name>ПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодПредыдущегоГода</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>ВалютаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияОтчета</name>
  </enumValues>
  <enumValues>
    <name>НеПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийФакта</name>
  </enumValues>
  <enumValues>
    <name>Аналитика1</name>
  </enumValues>
  <enumValues>
    <name>Аналитика2</name>
  </enumValues>
  <enumValues>
    <name>Аналитика3</name>
  </enumValues>
  <enumValues>
    <name>Аналитика4</name>
  </enumValues>
  <enumValues>
    <name>Аналитика5</name>
  </enumValues>
  <enumValues>
    <name>Аналитика6</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>СписокФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>СписокПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ОтборПоРеквизитамАналитики</name>
  </enumValues>
  <enumValues>
    <name>НеРавноФиксированномуЗначению</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ИнтервалПериодов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИЛИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаНЕ</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеСписокЗначений</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчетаИерархия</name>
  </enumValues>
  <enumValues>
    <name>ВышестоящийПериод</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсходныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ТипЗначения</name>
  </enumValues>
  <enumValues>
    <name>СписокТиповЗначений</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/CommonModules/НастройкаУниверсальныхОтчетовПоРегистрамУХ/Module.bsl
Функция СформироватьСтрокуОтборов(ТабПравилаВычисленияПараметров) Экспорт
	
	СтрокаОтбор="";
	
	Для Каждого СтрОтбор ИЗ ТабПравилаВычисленияПараметров Цикл
		
		Если (Не СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется) Тогда
			
			Если СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" = "+СтрОтбор.УточнениеСпособаОпределения;
				
			ИначеЕсли СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеРавноФиксированномуЗначению Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" <> "+СтрОтбор.УточнениеСпособаОпределения;
				
			ИначеЕсли СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.Больше Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" > "+СтрОтбор.УточнениеСпособаОпределения;
				
			ИначеЕсли СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.БольшеИлиРавно Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" >= "+СтрОтбор.УточнениеСпособаОпределения;
				
			ИначеЕсли СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.Меньше Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" < "+СтрОтбор.УточнениеСпособаОпределения;
				
			ИначеЕсли СтрОтбор.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.МеньшеИлиРавно Тогда
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" <= "+СтрОтбор.УточнениеСпособаОпределения;
				
			Иначе
				
				СтрокаОтбор=СтрокаОтбор+", "+СтрОтбор.ИмяПараметра+" "+СтрОтбор.СпособВычисленияПараметра+" "+ОбщегоНазначенияУХ.ПолучитьСтрокуИзСпискаЗначенийПоПредставлению(СтрОтбор.УточнениеСпособаОпределения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
				
	Возврат Сред(СтрокаОтбор,2);				 
	 
КонецФункции // СформироватьСтрокуОтборов()
